/*Ресторант отваря врати и предлага няколко менюта на преференциални цени: 
•	Пилешко меню –  10.35 лв. 
•	Меню с риба – 12.40 лв. 
•	Вегетарианско меню  – 8.15 лв. 
Напишете програма, която изчислява колко ще струва на група хора да си поръчат храна за вкъщи.
Групата ще си поръча и десерт, чиято цена е равна на 20% от общата сметка (без доставката). 
Цената на доставка е 2.50 лв и се начислява най-накрая.  
Вход
От конзолата се четат 3 реда:
•	Брой пилешки менюта – цяло число в интервала [0 … 99]
•	Брой менюта с риба – цяло число в интервала [0 … 99]
•	Брой вегетариански менюта – цяло число в интервала [0 … 99]
Изход
Да се отпечата на конзолата един ред:  "{цена на поръчката}"


*/

function foodDelivery(input) { 
    let countP = parseFloat(input[0]);
    let countF = parseFloat(input[1]);
    let countV = parseFloat(input[2]);
    let pile =countP * 10.35;
    let riba =countF * 12.40;
    let vegan = countV * 8.15;
    let price = pile + riba + vegan;
    let desert = price * 20/100;
    let dostavka = 2.50;
    let fullPrice = (price+desert) + dostavka;
    console.log(`Cenata e ${fullPrice}!`);
}
foodDelivery(["2", "4", "3"]);


